lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LM3Sxxxx.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_LM3Sxxxx.c
 *      Purpose: CAN Driver, Hardware specific module for Luminary LM3Sxxxx
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <LM3Sxxxx.h>                 /* LM3Sxxxx library definitions        */

#pragma diag_suppress 177

/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Module Clock (in Hz) <1000000-50000000>
//     <i> Default: 8000000
#define CAN_CLOCK         8000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static U32       Rd                  (U32 reg_adr)
 *    static void      Wr                  (U32 reg_adr, U32 val)
 *    static CAN_ERROR CAN_get_ctrl        (U32 ctrl, U32 *ptr_can) 
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_loopback     (U32 ctrl)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl,         CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, U32 ch, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl,         CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuctions
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd                (U32 ctrl, U32 ch, CAN_msg *msg);
#if USE_CAN_CTRL1 == 1
  void CAN0_IRQHandler               (void) __irq;
#endif
#if USE_CAN_CTRL2 == 1
  void CAN1_IRQHandler               (void) __irq;
#endif
#if USE_CAN_CTRL3 == 1
  void CAN2_IRQHandler               (void) __irq;
#endif

/* Static functions used only in this module (only used because errata)      */
static U32  Rd                       (U32 reg_adr);
static void Wr                       (U32 reg_adr, U32 val);

/* Global variables used in this module                                      */
static U32  clk_ratio = 1;            /* SYS clk / CAN clk ratio             */


/************************* Auxiliary Functions *******************************/

/*--------------------------- Rd --------------------------------------------
 *
 *  Read CAN register with software delay to workaround hardware problem    
 *
 *  Parameter:  reg_adr:    Address of CAN register
 *
 *  Return:     U32:        Read register value
 *---------------------------------------------------------------------------*/

static U32 Rd (U32 reg_adr)
{
  U32 i;
  U32 ret_val;
  U32 int_reenable;
  U32 int_msk;

  switch (reg_adr & 0xFFFFF000) {     /* Get CAN controller interrupt mask   */
    case CAN0_BASE:
      int_msk = (1 << (INT_CAN0 - 48));
      break;
    case CAN1_BASE:
      int_msk = (1 << (INT_CAN1 - 48));
      break;
    default:
      int_msk = (1 << (INT_CAN0 - 48));
      break;
  }

  /* Remember interrupt enable state                                         */
  int_reenable = HWREG(NVIC_EN1) & int_msk;

  /* Disable current CAN controller interrupt if enabled                     */
  if (int_reenable)
    HWREG (NVIC_DIS1) = int_msk;

  HWREG (reg_adr);                    /* Dummy read                          */

  for(i = 0; i < clk_ratio; i++);     /* Wait for at least SYSclk/CANclk     */

  ret_val = HWREG (reg_adr);          /* Real register read value            */

  /* Reenable current CAN controller interrupt if it was enabled before      */
  if (int_reenable)
    HWREG (NVIC_EN1) = int_msk;

  return (ret_val);                   /* Return read register value          */
}

/*--------------------------- Wr --------------------------------------------
 *
 *  Write CAN register with software delay to workaround hardware problem    
 *
 *  Parameter:  reg_adr:    Address of CAN register
 *              val:        Value to be written
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void Wr (U32 reg_adr, U32 val)
{
  U32 i;

  HWREG (reg_adr) = val;              /* Write value                         */

  for(i = 0; i < clk_ratio; i++);     /* Wait for at least SYSclk/CANclk     */
}

/*--------------------------- CAN_get_ctrl ----------------------------------
 *
 *  Get address and return it in parameter of function, of controller which 
 *  index is passed as parameter
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              ptr_can:    Address of CAN controller in memory map (returned)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_get_ctrl (U32 ctrl, U32 *ptr_can) {

  switch (ctrl) {
    case 1: 
      *ptr_can = CAN0_BASE;
      break;
    case 2: 
      *ptr_can = CAN1_BASE;
      break;
    case 3: 
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 CANx;
  U32 brp = CAN_CLOCK;                /* CAN module clock                    */

