lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LM3Sxxxx.c
  /* Set the message valid bit                                               */
  Wr(CANx + CAN_O_IF1ARB2, Rd(CANx + CAN_O_IF1ARB2) | CAN_IFARB2_MSGVAL);

  /* Update informations from interface registers                            */
  Wr(CANx + CAN_O_IF1CRQ,  msg->ch);

  return CAN_OK;
}

/*--------------------------- CAN_hw_rd -------------------------------------
 *
 *  Read CAN_msg from the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              ch:         Index of object used for reception (1..32)
 *              msg:        Pointer where CAN message will be read
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void CAN_hw_rd (U32 ctrl, U32 ch, CAN_msg *msg)  {
  U32 CANx;
  U32 arb1, arb2;

  CAN_get_ctrl(ctrl, &CANx);            /* Get address of CAN controller     */

  /* Read the message contents to interface registers                        */
  Wr(CANx + CAN_O_IF2CMSK, CAN_IFCMSK_ARB       | 
                           CAN_IFCMSK_CONTROL   |
                           CAN_IFCMSK_CLRINTPND |
                           CAN_IFCMSK_DATAA     |
                           CAN_IFCMSK_DATAB);

  /* Request read to interface registers                                     */
  Wr(CANx + CAN_O_IF2CRQ, ch);

  arb1 = Rd(CANx + CAN_O_IF2ARB1);      /* Read ARB1 value                   */
  arb2 = Rd(CANx + CAN_O_IF2ARB2);      /* Read ARB2 value                   */

  /* Read identifier information                                             */
  if (!(arb2 & CAN_IFARB2_XTD)) {                       /* Standard ID       */
    msg->format = STANDARD_FORMAT;
    msg->id     = (arb2 >> 2) & 0x07FF;
  }  else  {                                            /* Extended ID       */
    msg->format = EXTENDED_FORMAT;
    msg->id     =  (((U32)(arb2) << 16) | 0x1FFF)
                  | ((U32)(arb1) & 0xFFFF);
  }

  /* Read type information                                                   */
  if (arb2 & CAN_IFARB2_DIR) {                              /* DATA   FRAME  */
    msg->type = REMOTE_FRAME;
  }  else  {                                                /* REMOTE FRAME  */
    msg->type =   DATA_FRAME;
  }

  msg->ch      = ch;                    /* Reception channel                 */

  /* Read length (number of received bytes)                                  */
  msg->len     = Rd(CANx + CAN_O_IF2MCTL) & 0x0F;

  /* Read data bytes                                                         */
  msg->data[0] = (U8) Rd(CANx + CAN_O_IF2DA1);
  msg->data[1] = (U8)(Rd(CANx + CAN_O_IF2DA1) >> 8);
  msg->data[2] = (U8) Rd(CANx + CAN_O_IF2DA2);
  msg->data[3] = (U8)(Rd(CANx + CAN_O_IF2DA2) >> 8);
  msg->data[4] = (U8) Rd(CANx + CAN_O_IF2DB1);
  msg->data[5] = (U8)(Rd(CANx + CAN_O_IF2DB1) >> 8);
  msg->data[6] = (U8) Rd(CANx + CAN_O_IF2DB2);
  msg->data[7] = (U8)(Rd(CANx + CAN_O_IF2DB2) >> 8);
}

/*--------------------------- CAN_hw_set ------------------------------------
 *  Set a message that will automatically be sent as an answer to the REMOTE
 *  FRAME message
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              msg:        Pointer to CAN message to be set
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_set (U32 ctrl, CAN_msg *msg)  {
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);            /* Get address of CAN controller     */

  /* Set flags for informations that will be changed                         */
  Wr(CANx + CAN_O_IF1CMSK,  CAN_IFCMSK_WRNRD   | 
                            CAN_IFCMSK_ARB     | 
                            CAN_IFCMSK_CONTROL |
                            CAN_IFCMSK_DATAA   |
                            CAN_IFCMSK_DATAB);

  /* Setup the identifier information                                        */
  if (msg->format == STANDARD_FORMAT)  {  /* Standard ID                     */
    Wr(CANx + CAN_O_IF1ARB1, 0);
    Wr(CANx + CAN_O_IF1ARB2, (U16) (msg->id << 2));
  }  else  {                              /* Extended ID                     */
    Wr(CANx + CAN_O_IF1ARB1, (U16) (msg->id));
    Wr(CANx + CAN_O_IF1ARB2, (U16)((msg->id) >> 16) | CAN_IFARB2_XTD);
  }

  /* Setup type information                                                  */
  if (msg->type == DATA_FRAME)  {         /* DATA FRAME                      */
    Wr(CANx + CAN_O_IF1ARB2, Rd(CANx + CAN_O_IF1ARB2) | CAN_IFARB2_DIR);
  }

  /* Setup data bytes                                                        */
  Wr(CANx + CAN_O_IF1DA1, ((U16) msg->data[1]<<8) | msg->data[0]);
  Wr(CANx + CAN_O_IF1DA2, ((U16) msg->data[3]<<8) | msg->data[2]);
  Wr(CANx + CAN_O_IF1DB1, ((U16) msg->data[5]<<8) | msg->data[4]);
  Wr(CANx + CAN_O_IF1DB2, ((U16) msg->data[7]<<8) | msg->data[6]);

  /* Setup length and message control bits                                   */
  Wr(CANx + CAN_O_IF1MCTL, CAN_IFMCTL_NEWDAT | 
                           CAN_IFMCTL_RMTEN  |
                           CAN_IFMCTL_EOB    |
                           (msg->len & 0x000F));

  /* Set the message valid bit                                               */
  Wr(CANx + CAN_O_IF1ARB2, Rd(CANx + CAN_O_IF1ARB2) | CAN_IFARB2_MSGVAL);

  /* Update informations from interface registers                            */
  Wr(CANx + CAN_O_IF1CRQ, msg->ch);

  return CAN_OK;
}

/*--------------------------- CAN_hw_rx_object ------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  reception
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              ch:         Index of object used for reception
 *              id:         Identifier of receiving messages
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_rx_object (U32 ctrl, U32 ch, U32 id, U32 object_para)  {
  U32 ofs;
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);            /* Get address of CAN controller     */

