lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_LM3Sxxxx.c
  /* Wait for the first free interface register                              */
  do  {
    if (!(Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY))  {
      ofs = 0;
      break;
    }  else if (!(Rd(CANx + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY))  {
      ofs = (CAN_O_IF2CRQ - CAN_O_IF1CRQ);
      break;
    }
  }  while (1);

  /* Set flags for informations that will be changed                         */
  Wr(CANx + CAN_O_IF1CMSK + ofs,  CAN_IFCMSK_WRNRD   | 
                                  CAN_IFCMSK_MASK    |
                                  CAN_IFCMSK_ARB     | 
                                  CAN_IFCMSK_CONTROL |
                                  CAN_IFCMSK_DATAA   |
                                  CAN_IFCMSK_DATAB);

  /* Setup the identifier information                                        */
  if ((object_para & FORMAT_TYPE) == STANDARD_TYPE)  { /* Standard ID        */
    Wr(CANx + CAN_O_IF1MSK1 + ofs, 0);
    Wr(CANx + CAN_O_IF1MSK2 + ofs, (U16)(0x7FF << 2));

    Wr(CANx + CAN_O_IF1ARB1 + ofs, 0);
    Wr(CANx + CAN_O_IF1ARB2 + ofs, CAN_IFARB2_MSGVAL | (U16)(id << 2));
  }  else  {                              /* Extended ID                     */
    Wr(CANx + CAN_O_IF1MSK1 + ofs, (U16)(0xFFFF));
    Wr(CANx + CAN_O_IF1MSK2 + ofs, CAN_IFMSK2_MXTD | (U16)(0x1FFF));

    Wr(CANx + CAN_O_IF1ARB1 + ofs, (U16)(id));
    Wr(CANx + CAN_O_IF1ARB2 + ofs, CAN_IFARB2_MSGVAL | CAN_IFARB2_XTD | (U16)(id >> 16));
  }

  /* Setup length and message control bits                                   */
  Wr(CANx + CAN_O_IF1MCTL + ofs,  CAN_IFMCTL_UMASK  | 
                                  CAN_IFMCTL_RXIE   |
                                  CAN_IFMCTL_EOB    );

  /* Setup data bytes                                                        */
  Wr(CANx + CAN_O_IF1DA1 + ofs, 0);
  Wr(CANx + CAN_O_IF1DA2 + ofs, 0);
  Wr(CANx + CAN_O_IF1DB1 + ofs, 0);
  Wr(CANx + CAN_O_IF1DB2 + ofs, 0);

  /* Update informations from interface registers                            */
  Wr(CANx + CAN_O_IF1CRQ + ofs, ch);

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_object ------------------------------
 *
 *  This function setups object that is going to be used for the message 
 *  transmission, the setup of transmission object is not necessery so this 
 *  function is not implemented
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              ch:         Index of object used for transmission
 *              object_para:Object parameters (standard or extended format, 
 *                          data or remote frame)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_object (U32 ctrl, U32 ch, U32 object_para)  {

  return CAN_OK;
}


/************************* Interrupt Functions *******************************/

#if USE_CAN_CTRL1 == 1

/*--------------------------- CAN0_IRQHandler -------------------------------
 *
 *  CAN interrupt function 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *---------------------------------------------------------------------------*/

#define CTRL0                 0
#define CTRL                  1
#define CANc                  CAN0_BASE

void CAN0_IRQHandler (void) __irq  {
  U32 ch, status;
  CAN_msg *ptrmsg;

  ch = Rd(CANc + CAN_O_INT);          /* Index of object that caused         */
                                      /* interrupt                           */
  status = Rd(CANc + CAN_O_STS);      /* Read status register                */

  if ((ch-1)<32)  {                   /* Check if index in range 1 - 32      */

    /* Wait until Interface Register 2 becomes free                          */
    while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

    if (status & CAN_STS_TXOK)  {                       /* Tx interrupt      */
      /* Clear Tx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_TXOK);

      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release tx object */
      Wr(CANc + CAN_O_IF2CRQ , ch);

      /* Wait until Interface Register 2 becomes free                        */
      while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        /* If there is a message in the mailbox ready for send, read the 
           message from the mailbox and send it                              */
        if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
          /* Wait until Interface Register 1 becomes free                    */
          while (Rd(CANc + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);

          CAN_hw_wr (CTRL, ptrmsg);
          _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL0]);  /* Return a token back to semaphore    */
      }
    }  else {                                           /* Rx interrupt      */
                                      /* It should have been checked like
                                         "if (status & CAN_STS_RXOK)"
                                         but isn't because in TEST mode RxOk 
                                         flag in Status Register isn't 
                                         activated upon reception of message */
      /* Clear Rx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_RXOK);

      /* If the mailbox isn't full read the message from the hardware and
         send it to the message queue                                        */
      if (isr_mbx_check (MBX_rx_ctrl[CTRL0]) > 0)  {
        /* Wait until Interface Register 2 becomes free                      */
        while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        ptrmsg = _alloc_box (CAN_mpool);
        if (ptrmsg) {
          CAN_hw_rd (CTRL, ch, ptrmsg); /* Read received message             */
          isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
        }
      }

